# Выведите на экран второй и второй с конца элементы через запятую

employee_list = ["Jonh Snow", "Piter Pen", "Drakula", "IvanIV", "Moana", "Juilet"]

print(employee_list[1] + ", " + (employee_list[-2]))