# Создайте список [25, 20, 15, 10, 5] с помощью функции range() и выведите его на экран

my_list = list(range(25, 0, - 5))

print(my_list)